In [2]:
# Import of pandas and assignation of its access name
import pandas as pd

In [3]:
# Creation of data frame
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

In [4]:
# Creation of data frame
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})

In [5]:
# Display of the first data frame
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [6]:
# Display of the second data frame
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [12]:
# Similar to how a join works
# There are only four types of join: inner, left, right, full
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue', 'Shannon',],
                   'profession': ['Engineering', 'Phd', 'Architect', 'Pilot', 'Lawyer'],
                   'salary': [70000, 80000, 120000, 90000, 0]})

In [14]:
# Display of the third dataframe
df3

      name   profession  salary
0      Bob  Engineering   70000
1     Jake          Phd   80000
2     Lisa    Architect  120000
3      Sue        Pilot   90000
4  Shannon       Lawyer       0

In [15]:
print(pd.merge(df1, df2, on = 'employee'))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [16]:
# Merge of two dataframes
pd.merge(df1, df3, left_on = 'employee', right_on= 'name')

  employee        group  name   profession  salary
0      Bob   Accounting   Bob  Engineering   70000
1     Jake  Engineering  Jake          Phd   80000
2     Lisa  Engineering  Lisa    Architect  120000
3      Sue           HR   Sue        Pilot   90000

In [23]:
# Merge of two dataframes while deleting a repeated column by the axis name
# In this case we drop column 'name'
# 'Axis = 1' references a column while 'Axis = 0' references a row
pd.merge(df1, df3, left_on = 'employee', right_on = 'name').drop('name', axis = 1)

  employee        group   profession  salary
0      Bob   Accounting  Engineering   70000
1     Jake  Engineering          Phd   80000
2     Lisa  Engineering    Architect  120000
3      Sue           HR        Pilot   90000

In [24]:
# Dataframe merge with the drop of columns collected from a group
pd.merge(df1, df3, left_on = 'employee', right_on = 'name').drop(['name', 'salary'], axis = 1)

  employee        group   profession
0      Bob   Accounting  Engineering
1     Jake  Engineering          Phd
2     Lisa  Engineering    Architect
3      Sue           HR        Pilot

In [25]:
# Dataframe merge with the drop of rows collected from a group
pd.merge(df1, df3, left_on = 'employee', right_on = 'name').drop([0, 1], axis = 0)

  employee        group  name profession  salary
2     Lisa  Engineering  Lisa  Architect  120000
3      Sue           HR   Sue      Pilot   90000

In [28]:
# left_on and right_on are the value in which the two dataframes collide
# You can think of it like a Venn Diagram, left_on and right_on are the collision
# In this case employee and name referencing the same values
pd.merge(df1, df3, left_on = 'employee', right_on = 'name').drop('name', axis = 1)

  employee        group   profession  salary
0      Bob   Accounting  Engineering   70000
1     Jake  Engineering          Phd   80000
2     Lisa  Engineering    Architect  120000
3      Sue           HR        Pilot   90000

In [29]:
# Here, we assign an index to the dataframe
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
df3a = df2.set_index('employee')

In [34]:
# Here, we can see that once we do the merge without the need to tell which are the indexes
pd.merge(df2a, df3a, left_index = True, right_index = True)

          hire_date_x  hire_date_y
employee
Lisa             2004         2004
Bob              2008         2008
Jake             2012         2012
Sue              2014         2014

In [35]:
# Here, we do a merge and we only use the index for the left one while we have to assign the
# referencing value for the second one
pd.merge(df1a, df3, left_index = True, right_on = 'name')

         group  name   profession  salary
0   Accounting   Bob  Engineering   70000
1  Engineering  Jake          Phd   80000
2  Engineering  Lisa    Architect  120000
3           HR   Sue        Pilot   90000

In [36]:
# We can do an inner merge because we have the same parameters
pd.merge(df1, df2, how = 'inner')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [37]:
# Left and right bring both the join or intersection and the selected side
pd.merge(df1, df2, how = 'left')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [38]:
pd.merge(df1, df2, how = 'right')

  employee        group  hire_date
0     Lisa  Engineering       2004
1      Bob   Accounting       2008
2     Jake  Engineering       2012
3      Sue           HR       2014

In [43]:
df2.groupby('employee')['hire_date'].sum()

employee
Bob     2008
Jake    2012
Lisa    2004
Sue     2014
Name: hire_date, dtype: int64

In [58]:
dfGroup = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue', 'Regina', 'Regina'],
                   'hire_date': [2004, 2008, 2012, 2014, 0, 0],
                    'saving': [1000, 100, 20, 30, 10, 5000]})

In [51]:
dfGroup

  employee  hire_date  saving
0     Lisa       2004    1000
1      Bob       2008     100
2     Jake       2012      20
3      Sue       2014      30
4   Regina          0      10

In [60]:
dfGroup.groupby('employee')['saving'].sum()

employee
Bob        100
Jake        20
Lisa      1000
Regina    5010
Sue         30
Name: saving, dtype: int64

In [59]:
dfGroup.groupby('employee')['saving'].mean()

employee
Bob        100.0
Jake        20.0
Lisa      1000.0
Regina    2505.0
Sue         30.0
Name: saving, dtype: float64

In [61]:
import numpy as np

In [64]:
dfGroup.groupby('employee').aggregate(['min', np.median, max])

         hire_date               saving
               min  median   max    min  median   max
employee
Bob           2008  2008.0  2008    100   100.0   100
Jake          2012  2012.0  2012     20    20.0    20
Lisa          2004  2004.0  2004   1000  1000.0  1000
Regina           0     0.0     0     10  2505.0  5000
Sue           2014  2014.0  2014     30    30.0    30

In [65]:
# It is possible to only bring a certain value and aggregate its values
dfGroup.groupby('employee')['saving'].aggregate(['min', np.median, max])

           min  median   max
employee
Bob        100   100.0   100
Jake        20    20.0    20
Lisa      1000  1000.0  1000
Regina      10  2505.0  5000
Sue         30    30.0    30